In [15]:
import pandas as pd

encoded_data = pd.read_csv('encoded_data.csv')
encoded_data.head()

,Customer Name,uid,business start date,business duration (years),Normalized Performance Index,business sector_Agriculture,business sector_Fisheries,business sector_Hospitality,business sector_IT,business sector_Manufacturing,...,education level_Vocational,duration range_0 - 5 years,duration range_5 - 10 years,duration range_10 - 15 years,duration range_15 - 20 years,transaction range_0 - 2000,transaction range_2000 - 4000,transaction range_4000 - 6000,transaction range_6000 - 8000,transaction range_8000 - 11000
0,James William,cca67301-ef3c-4496-b8fd-31847b7edd88,2013-02-25,10.58,0.077674,1,0,0,0,0,...,0,0,0,1,0,1,0,0,0,0
1,James Nansukusa,7a1c5730-b8e7-4774-8746-90a317b73a82,2009-02-22,14.59,0.068769,0,0,0,0,0,...,0,0,0,1,0,1,0,0,0,0
2,Nansukusa Sarah,fb94fff4-9217-470f-9e80-12621dea6191,2009-02-07,14.64,0.068522,0,1,0,0,0,...,1,0,0,1,0,1,0,0,0,0
3,Bridget Namwalwa,ff0563dc-6006-4b4f-a88a-1e7b64adb040,2016-04-15,7.45,0.061839,0,0,0,0,1,...,0,0,1,0,0,1,0,0,0,0
4,William William,a185cde9-4893-42c0-bcad-fbcf101d2a77,2013-03-15,10.53,0.061649,0,0,1,0,0,...,0,0,0,1,0,1,0,0,0,0

## Use Kmeans Clusters to create clusters

In [19]:
from sklearn.cluster import KMeans

encoded_data_cleaned = encoded_data.drop(columns=['Customer Name', 'uid', 'business start date'])

# apply kmeans
kmeans = KMeans(n_clusters=5, random_state=42)

#create a new column called cluster and add the kmeans clusters into that column
encoded_data_cleaned['cluster'] = kmeans.fit_predict(encoded_data_cleaned) 

# update the orgiginal clustering_data_df with the cluster column since we need the originial df to perfom the merge with the customer_data
# (need the uid)
encoded_data['cluster'] = encoded_data_cleaned['cluster'] 

encoded_data.head(3)

/Users/alice/Library/Python/3.9/lib/python/site-packages/sklearn/cluster/_kmeans.py:1416: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  super()._check_params_vs_input(X, default_n_init=10)

,Customer Name,uid,business start date,business duration (years),Normalized Performance Index,business sector_Agriculture,business sector_Fisheries,business sector_Hospitality,business sector_IT,business sector_Manufacturing,...,duration range_0 - 5 years,duration range_5 - 10 years,duration range_10 - 15 years,duration range_15 - 20 years,transaction range_0 - 2000,transaction range_2000 - 4000,transaction range_4000 - 6000,transaction range_6000 - 8000,transaction range_8000 - 11000,cluster
0,James William,cca67301-ef3c-4496-b8fd-31847b7edd88,2013-02-25,10.58,0.077674,1,0,0,0,0,...,0,0,1,0,1,0,0,0,0,4
1,James Nansukusa,7a1c5730-b8e7-4774-8746-90a317b73a82,2009-02-22,14.59,0.068769,0,0,0,0,0,...,0,0,1,0,1,0,0,0,0,2
2,Nansukusa Sarah,fb94fff4-9217-470f-9e80-12621dea6191,2009-02-07,14.64,0.068522,0,1,0,0,0,...,0,0,1,0,1,0,0,0,0,2

## CLuster Analysis
Given the 5 clusters we have created, we can now start analysis to answer our business question: